[
  {
    "id": "001",
    "set": "SET_A",
    "dom": "Industrial Chemistry",
    "topic": "Physical Chemistry",
    "lvl": 3,
    "q": "Which concentration term is defined as the number of moles of solute per kilogram of solvent and remains independent of temperature",
    "u": "Molality",
    "l": "Molarity",
    "r": "Normality",
    "correct": "Molality",
    "logic": "Molality is a measure of concentration that depends on the mass of the solvent. Because mass is not affected by changes in temperature or pressure, molality is preferred in thermodynamic calculations over volume dependent units.",
    "hint": "Mass based concentration is temperature independent.",
    "trap": "2026-01-28",
    "s1": "Analyze the effect of temperature on mass versus volume.",
    "s2": "VERIFIED",
    "ref": "CONCEPT:CONCENTRATION_UNITS",
    "link": "Confusing volume based units like molarity with mass based units.",
    "version": "1",
    "active": 1,
    "deprecated": 0,
    "status": "VERIFIED"
  },
  {
    "id": "002",
    "set": "SET_AA",
    "dom": "Industrial Chemistry",
    "topic": "Physical Chemistry",
    "lvl": 4,
    "q": "Why does the molarity of a solution change with temperature while molality remains constant",
    "u": "Molarity is based on the volume of solution which expands or contracts with temperature",
    "l": "Molarity is based on the mass of the solute which changes with heat",
    "r": "Molar mass of the solute increases as the temperature of the liquid rises",
    "correct": "Molarity is based on the volume of solution which expands or contracts with temperature",
    "logic": "Molarity is defined as moles of solute per liter of solution. Since the volume of a liquid is temperature dependent due to thermal expansion, the molarity value will change. Molality uses mass, which is a constant property.",
    "hint": "Volume expansion causes molarity to fluctuate with temperature.",
    "trap": "2026-01-28",
    "s1": "Connect thermal expansion of liquids to volume based units.",
    "s2": "VERIFIED",
    "ref": "LINK:001; CONCEPT:CONCENTRATION_UNITS",
    "link": "Assuming mass changes significantly with temperature in a closed system.",
    "version": "1",
    "active": 1,
    "deprecated": 0,
    "status": "VERIFIED"
  },
  {
    "id": "003",
    "set": "SET_A",
    "dom": "Industrial Chemistry",
    "topic": "Physical Chemistry",
    "lvl": 4,
    "q": "According to Henrys law how is the solubility of a gas in a liquid related to the partial pressure of the gas above the liquid",
    "u": "Solubility is directly proportional to the partial pressure of the gas",
    "l": "Solubility is inversely proportional to the partial pressure of the gas",
    "r": "Solubility is independent of the pressure of the gas phase",
    "correct": "Solubility is directly proportional to the partial pressure of the gas",
    "logic": "Henrys law states that at a constant temperature, the solubility of a gas in a liquid is directly proportional to the partial pressure of the gas present above the surface of the liquid or solution. This is expressed as pressure equals Henrys constant multiplied by mole fraction.",
    "hint": "Gas solubility increases linearly with increasing partial pressure.",
    "trap": "2026-01-28",
    "s1": "Define the proportionality constant Henrys constant.",
    "s2": "VERIFIED",
    "ref": "CONCEPT:HENRYS_LAW_SOLUBILITY",
    "link": "Applying the law to solids or liquids instead of gases.",
    "version": "1",
    "active": 1,
    "deprecated": 0,
    "status": "VERIFIED"
  },
  {
    "id": "004",
    "set": "SET_AA",
    "dom": "Industrial Chemistry",
    "topic": "Industrial Chemistry",
    "lvl": 3,
    "q": "In the industrial production of carbonated beverages why is the bottle sealed under high pressure of carbon dioxide",
    "u": "To increase the solubility of carbon dioxide in the soft drink",
    "l": "To prevent the liquid from evaporating during storage",
    "r": "To ensure the glass bottle remains structurally sound",
    "correct": "To increase the solubility of carbon dioxide in the soft drink",
    "logic": "According to Henrys law, the solubility of a gas increases with pressure. By sealing the bottle under high pressure of carbon dioxide, more gas is forced to dissolve in the beverage, providing the characteristic fizz when opened.",
    "hint": "High pressure maximizes the dissolved carbon dioxide content.",
    "trap": "2026-01-28",
    "s1": "Identify the relationship between headspace pressure and dissolved gas.",
    "s2": "VERIFIED",
    "ref": "LINK:003; CONCEPT:HENRYS_LAW_SOLUBILITY",
    "link": "Thinking the pressure is meant only for mechanical sealing.",
    "version": "1",
    "active": 1,
    "deprecated": 0,
    "status": "VERIFIED"
  },
  {
    "id": "005",
    "set": "SET_A",
    "dom": "Industrial Chemistry",
    "topic": "Physical Chemistry",
    "lvl": 4,
    "q": "What defines an ideal solution according to Raoults law across the entire range of concentration",
    "u": "A solution where the enthalpy of mixing and volume of mixing are both zero",
    "l": "A solution that always shows a positive deviation in vapor pressure",
    "r": "A solution where the solute solvent interactions are stronger than pure components",
    "correct": "A solution where the enthalpy of mixing and volume of mixing are both zero",
    "logic": "An ideal solution obeys Raoults law at all concentrations. In such a solution, the intermolecular attractive forces between A A and B B are nearly equal to A B. Consequently, there is no thermal change or volume change upon mixing the components.",
    "hint": "Ideal solutions have zero enthalpy and volume change on mixing.",
    "trap": "2026-01-28",
    "s1": "Identify the thermodynamic parameters of mixing.",
    "s2": "VERIFIED",
    "ref": "CONCEPT:RAOULTS_LAW_IDEAL",
    "link": "Assuming all liquid liquid mixtures behave ideally regardless of polarity.",
    "version": "1",
    "active": 1,
    "deprecated": 0,
    "status": "VERIFIED"
  },
  {
    "id": "006",
    "set": "SET_AA",
    "dom": "Industrial Chemistry",
    "topic": "Physical Chemistry",
    "lvl": 5,
    "q": "What is the term for a constant boiling mixture of liquids that has the same composition in the liquid and vapor phases",
    "u": "Azeotrope",
    "l": "Isotropic mixture",
    "r": "Eutectic mixture",
    "correct": "Azeotrope",
    "logic": "Azeotropes are binary mixtures having the same composition in liquid and vapor phase and boil at a constant temperature. In such cases, it is impossible to separate the components by fractional distillation because the vapor has the same ratio as the liquid.",
    "hint": "Azeotropes cannot be separated by simple fractional distillation.",
    "trap": "2026-01-28",
    "s1": "Explain the limitation of distillation for such mixtures.",
    "s2": "VERIFIED",
    "ref": "LINK:005; CONCEPT:RAOULTS_LAW_IDEAL",
    "link": "Confusing azeotropes with zeotropic mixtures that can be distilled.",
    "version": "1",
    "active": 1,
    "deprecated": 0,
    "status": "VERIFIED"
  },
  {
    "id": "007",
    "set": "SET_A",
    "dom": "Industrial Chemistry",
    "topic": "Electrochemistry",
    "lvl": 3,
    "q": "In a Galvanic cell at which electrode does the process of oxidation occur",
    "u": "Anode",
    "l": "Cathode",
    "r": "Salt bridge",
    "correct": "Anode",
    "logic": "In any electrochemical cell, the electrode where oxidation or loss of electrons takes place is called the anode. In a Galvanic cell, the anode is assigned a negative polarity as it is the source of electrons for the external circuit.",
    "hint": "Oxidation always occurs at the anode in electrochemical cells.",
    "trap": "2026-01-28",
    "s1": "Define the direction of electron flow in the cell.",
    "s2": "VERIFIED",
    "ref": "CONCEPT:GALVANIC_CELL_BASICS",
    "link": "Confusing the site of oxidation with the site of reduction.",
    "version": "1",
    "active": 1,
    "deprecated": 0,
    "status": "VERIFIED"
  },
  {
    "id": "008",
    "set": "SET_AA",
    "dom": "Industrial Chemistry",
    "topic": "Electrochemistry",
    "lvl": 5,
    "q": "What is the assigned standard electrode potential for the Standard Hydrogen Electrode at all temperatures",
    "u": "Zero volts",
    "l": "One volt",
    "r": "Zero point five volts",
    "correct": "Zero volts",
    "logic": "The Standard Hydrogen Electrode or S H E consists of platinum foil in one molar hydrochloric acid with hydrogen gas bubbled at one bar. By convention, its potential is assigned exactly zero volts, serving as the reference for all other electrodes.",
    "hint": "S H E is the universal reference with zero potential.",
    "trap": "2026-01-28",
    "s1": "Specify the numerical value of the S H E potential.",
    "s2": "VERIFIED",
    "ref": "LINK:007; CONCEPT:GALVANIC_CELL_BASICS",
    "link": "Thinking the potential varies based on the molarity of the acid used.",
    "version": "1",
    "active": 1,
    "deprecated": 0,
    "status": "VERIFIED"
  },
  {
    "id": "009",
    "set": "SET_A",
    "dom": "Industrial Chemistry",
    "topic": "Physical Chemistry",
    "lvl": 4,
    "q": "For a zero order reaction how does the rate of reaction change as the concentration of the reactants decreases over time",
    "u": "The rate remains constant and is independent of concentration",
    "l": "The rate decreases linearly with the concentration",
    "r": "The rate increases as the reactant is consumed",
    "correct": "The rate remains constant and is independent of concentration",
    "logic": "In a zero order reaction, the rate of reaction is proportional to the zero power of the concentration of reactants. This means the rate is equal to the rate constant k and does not change until the reactant is completely exhausted.",
    "hint": "Zero order rates are independent of the reactant concentration.",
    "trap": "2026-01-28",
    "s1": "Determine the slope of the concentration time plot.",
    "s2": "VERIFIED",
    "ref": "CONCEPT:ZERO_ORDER_KINETICS",
    "link": "Assuming the rate must slow down as reactants are depleted.",
    "version": "1",
    "active": 1,
    "deprecated": 0,
    "status": "VERIFIED"
  },
  {
    "id": "010",
    "set": "SET_AA",
    "dom": "Industrial Chemistry",
    "topic": "Physical Chemistry",
    "lvl": 4,
    "q": "What are the units of the rate constant for a zero order chemical reaction",
    "u": "Moles per liter per second",
    "l": "Per second",
    "r": "Liters per mole per second",
    "correct": "Moles per liter per second",
    "logic": "Since the rate of a zero order reaction is equal to the rate constant k, and the rate is expressed in change in concentration over time, the units for k are moles per liter per second or moles per decimeter cubed per second.",
    "hint": "Rate constant units match reaction rate units for zero order.",
    "trap": "2026-01-28",
    "s1": "Compare units across different reaction orders.",
    "s2": "VERIFIED",
    "ref": "LINK:009; CONCEPT:ZERO_ORDER_KINETICS",
    "link": "Applying first order units to a zero order scenario.",
    "version": "1",
    "active": 1,
    "deprecated": 0,
    "status": "VERIFIED"
  },
  {
    "id": "011",
    "set": "SET_A",
    "dom": "Industrial Chemistry",
    "topic": "Surface Chemistry",
    "lvl": 4,
    "q": "Which type of adsorption involves the formation of strong chemical bonds between the adsorbent and the adsorbate",
    "u": "Chemisorption",
    "l": "Physisorption",
    "r": "Desorption",
    "correct": "Chemisorption",
    "logic": "Chemisorption or chemical adsorption occurs when the gas molecules or atoms are held to the solid surface by chemical bonds. These bonds can be ionic or covalent in nature and are much stronger than Van der Waals forces.",
    "hint": "Chemisorption involves high energy chemical bond formation.",
    "trap": "2026-01-28",
    "s1": "Analyze the strength of the interaction in chemisorption.",
    "s2": "VERIFIED",
    "ref": "CONCEPT:ADSORPTION_TYPES",
    "link": "Assuming all adsorption is weak and easily reversible.",
    "version": "1",
    "active": 1,
    "deprecated": 0,
    "status": "VERIFIED"
  },
  {
    "id": "012",
    "set": "SET_AA",
    "dom": "Industrial Chemistry",
    "topic": "Surface Chemistry",
    "lvl": 5,
    "q": "Why is chemisorption often referred to as activated adsorption",
    "u": "It requires a high energy of activation to form chemical bonds",
    "l": "It only occurs when the surface is electrically charged",
    "r": "It involves the activation of the adsorbent by heating it in a vacuum",
    "correct": "It requires a high energy of activation to form chemical bonds",
    "logic": "Because chemisorption involves the formation of chemical bonds, it often requires a significant amount of activation energy to proceed. Similar to chemical reactions, the rate of chemisorption increases with an increase in temperature initially.",
    "hint": "Chemical bond formation requires overcoming an energy barrier.",
    "trap": "2026-01-28",
    "s1": "Explain the temperature dependence of chemisorption.",
    "s2": "VERIFIED",
    "ref": "LINK:011; CONCEPT:ADSORPTION_TYPES",
    "link": "Confusing physical surface area activation with chemical activation energy.",
    "version": "1",
    "active": 1,
    "deprecated": 0,
    "status": "VERIFIED"
  },
  {
    "id": "013",
    "set": "SET_A",
    "dom": "Industrial Chemistry",
    "topic": "Solid State",
    "lvl": 4,
    "q": "What is the coordination number of an atom in a cubic close packed or C C P structure",
    "u": "Twelve",
    "l": "Eight",
    "r": "Six",
    "correct": "Twelve",
    "logic": "In both cubic close packed or C C P and hexagonal close packed or H C P structures, each sphere is in contact with twelve other spheres six in its own layer, three in the layer above, and three in the layer below.",
    "hint": "Maximum efficiency packing results in twelve nearest neighbors.",
    "trap": "2026-01-28",
    "s1": "Count the number of neighboring spheres touching a central sphere.",
    "s2": "VERIFIED",
    "ref": "CONCEPT:CRYSTAL_LATTICE_PACKING",
    "link": "Confusing C C P with Body Centered Cubic or B C C coordination.",
    "version": "1",
    "active": 1,
    "deprecated": 0,
    "status": "VERIFIED"
  },
  {
    "id": "014",
    "set": "SET_AA",
    "dom": "Industrial Chemistry",
    "topic": "Solid State",
    "lvl": 5,
    "q": "What is the packing efficiency of a face centered cubic unit cell",
    "u": "Seventy four percent",
    "l": "Sixty eight percent",
    "r": "Fifty two point four percent",
    "correct": "Seventy four percent",
    "logic": "Packing efficiency is the percentage of total space filled by the particles. For F C C and C C P structures, the efficiency is calculated to be seventy four percent, which is the highest possible packing efficiency for spheres of equal size.",
    "hint": "F C C structures utilize seventy four percent of available space.",
    "trap": "2026-01-28",
    "s1": "Calculate the space occupied by four spheres in an F C C unit cell.",
    "s2": "VERIFIED",
    "ref": "LINK:013; CONCEPT:CRYSTAL_LATTICE_PACKING",
    "link": "Selecting the efficiency for B C C or Simple Cubic structures.",
    "version": "1",
    "active": 1,
    "deprecated": 0,
    "status": "VERIFIED"
  },
  {
    "id": "015",
    "set": "SET_A",
    "dom": "Industrial Chemistry",
    "topic": "Inorganic Chemistry",
    "lvl": 4,
    "q": "Most transition metal ions exhibit paramagnetism due to the presence of what feature in their electronic configuration",
    "u": "Unpaired electrons in the d orbitals",
    "l": "Completely filled d subshells",
    "r": "Pairs of electrons with opposite spins in the s orbital",
    "correct": "Unpaired electrons in the d orbitals",
    "logic": "Paramagnetism arises from the presence of one or more unpaired electrons. Since transition metals have partially filled d orbitals, they frequently possess unpaired electrons which are attracted by a magnetic field.",
    "hint": "Unpaired d electrons create a permanent magnetic moment.",
    "trap": "2026-01-28",
    "s1": "Relate electron spin to the magnetic properties of the atom.",
    "s2": "VERIFIED",
    "ref": "CONCEPT:TRANSITION_METAL_PROPERTIES",
    "link": "Thinking magnetism depends on the total number of electrons regardless of pairing.",
    "version": "1",
    "active": 1,
    "deprecated": 0,
    "status": "VERIFIED"
  },
  {
    "id": "016",
    "set": "SET_AA",
    "dom": "Industrial Chemistry",
    "topic": "Inorganic Chemistry",
    "lvl": 5,
    "q": "Why are most coordination compounds of transition metals colored",
    "u": "Electrons undergo d d transitions by absorbing specific wavelengths of visible light",
    "l": "The metal ions reflect all wavelengths of light except for black",
    "r": "The ligands undergo a chemical reaction that releases colored gas",
    "correct": "Electrons undergo d d transitions by absorbing specific wavelengths of visible light",
    "logic": "The color of transition metal complexes is usually due to d d transitions. When light falls on the complex, an electron from a lower energy d orbital is excited to a higher energy d orbital. The color observed is the complementary color of the light absorbed.",
    "hint": "Excitation of d electrons between split energy levels causes color.",
    "trap": "2026-01-28",
    "s1": "Connect photon absorption to the observed complementary color.",
    "s2": "VERIFIED",
    "ref": "LINK:015; CONCEPT:TRANSITION_METAL_PROPERTIES",
    "link": "Attributing color to the ligands themselves rather than the metal ligand interaction.",
    "version": "1",
    "active": 1,
    "deprecated": 0,
    "status": "VERIFIED"
  },
  {
    "id": "017",
    "set": "SET_A",
    "dom": "Industrial Chemistry",
    "topic": "Organic Chemistry",
    "lvl": 4,
    "q": "Which type of nucleophilic substitution reaction proceeds through the formation of a stable carbocation intermediate",
    "u": "S N one reaction",
    "l": "S N two reaction",
    "r": "Electrophilic addition",
    "correct": "S N one reaction",
    "logic": "The S N one reaction or Unimolecular Nucleophilic Substitution occurs in two steps. The first and slowest step is the ionization of the substrate to form a carbocation intermediate, which is then attacked by a nucleophile in the second step.",
    "hint": "S N one reactions involve a distinct carbocation intermediate.",
    "trap": "2026-01-28",
    "s1": "Analyze the structural requirement for intermediate formation.",
    "s2": "VERIFIED",
    "ref": "CONCEPT:SN1_REACTION_STABILITY",
    "link": "Confusing the two step S N one with the single step S N two.",
    "version": "1",
    "active": 1,
    "deprecated": 0,
    "status": "VERIFIED"
  },
  {
    "id": "018",
    "set": "SET_AA",
    "dom": "Industrial Chemistry",
    "topic": "Organic Chemistry",
    "lvl": 5,
    "q": "Which type of alkyl halide is most reactive toward the S N one mechanism due to the stability of the resulting carbocation",
    "u": "Tertiary alkyl halides",
    "l": "Primary alkyl halides",
    "r": "Methyl halides",
    "correct": "Tertiary alkyl halides",
    "logic": "Tertiary alkyl halides are most reactive in S N one reactions because they form tertiary carbocations, which are stabilized by inductive effects and hyperconjugation from three alkyl groups. Primary halides are the least reactive.",
    "hint": "Stability of the tertiary carbocation drives S N one reactivity.",
    "trap": "2026-01-28",
    "s1": "Predict reaction rates based on intermediate stability.",
    "s2": "VERIFIED",
    "ref": "LINK:017; CONCEPT:SN1_REACTION_STABILITY",
    "link": "Applying S N two reactivity trends to an S N one reaction.",
    "version": "1",
    "active": 1,
    "deprecated": 0,
    "status": "VERIFIED"
  },
  {
    "id": "019",
    "set": "SET_A",
    "dom": "Industrial Chemistry",
    "topic": "Organic Chemistry",
    "lvl": 4,
    "q": "The Gabriel Phthalimide Synthesis is a specific laboratory method used for the preparation of which class of amines",
    "u": "Primary aliphatic amines",
    "l": "Secondary aliphatic amines",
    "r": "Primary aromatic amines",
    "correct": "Primary aliphatic amines",
    "logic": "Gabriel Phthalimide Synthesis involves the reaction of phthalimide with ethanolic potassium hydroxide to form potassium phthalimide, which then reacts with an alkyl halide. Hydrolysis of the resulting product yields a pure primary aliphatic amine.",
    "hint": "Method for producing pure primary aliphatic amines.",
    "trap": "2026-01-28",
    "s1": "Identify the limitation on the degree of the resulting amine.",
    "s2": "VERIFIED",
    "ref": "CONCEPT:AMINE_SYNTHESIS_GABRIEL",
    "link": "Thinking the method can easily produce secondary or tertiary amines.",
    "version": "1",
    "active": 1,
    "deprecated": 0,
    "status": "VERIFIED"
  },
  {
    "id": "020",
    "set": "SET_AA",
    "dom": "Industrial Chemistry",
    "topic": "Organic Chemistry",
    "lvl": 5,
    "q": "Why cannot primary aromatic amines like aniline be prepared by the Gabriel Phthalimide Synthesis",
    "u": "Aryl halides do not undergo nucleophilic substitution with the phthalimide ion",
    "l": "Aromatic amines are too unstable to be formed by hydrolysis",
    "r": "Phthalimide does not react with aromatic bases",
    "correct": "Aryl halides do not undergo nucleophilic substitution with the phthalimide ion",
    "logic": "Aryl halides do not undergo nucleophilic substitution with the anion formed by phthalimide because the carbon halogen bond in aryl halides has partial double bond character and the aryl group is resistant to nucleophilic attack.",
    "hint": "Aryl halides are resistant to nucleophilic attack.",
    "trap": "2026-01-28",
    "s1": "Determine why the nucleophilic attack step fails for aromatic rings.",
    "s2": "VERIFIED",
    "ref": "LINK:019; CONCEPT:AMINE_SYNTHESIS_GABRIEL",
    "link": "Assuming the reaction works for all types of organic halides.",
    "version": "1",
    "active": 1,
    "deprecated": 0,
    "status": "VERIFIED"
  }
]
